# Да се напише SHELL скрипта која како аргумент од командна линија добива име на датотека.
# Скриптата треба да ја трансформира датотеката така што ќе ги замени цртичките, запирките и
# извичниците со точка. Потоа, SHELL скриптата треба да ја повика Python скриптата prva.py
# и на екран да ја прикаже содржината на
# резултантната датотека (од повикот на Python скриптата). 

#!/bin/bash

if [ $# -ne 1 ]; then
    echo "Nedovolen broj na argumenti"
    exit 1
fi

dat=$1

if [ ! -f "$dat" ]; then
    echo "Datotekata $dat ne postoi!"
    exit 1
fi

sed -i 's/[-,!]/./g' "$dat"

python3 prva.py "$dat"

# # Да се изврши заменување на првото појавување на зборот „voda“ со „struja“

# sed 's/voda/struja/' vodovod.txt

# # Да се изврши заменување на секое појавување на зборот „voda“ со „struja“

# sed 's/voda/struja/g' vodovod.txt

# # Да се избришат сите линии што почнуваат со голема буква

# sed '/^[A-Z]/d' vodovod.txt

# # Да се избришат сите линии што започнуваат со голема буква а завршуваат со точка.

# sed '/^[A-Z].*\.$/d' vodovod.txt