# Да се напише Shell скрипта која треба да ги најде сите датотеки во тековниот директориум (и под-директориуми) чие што
# име завршува на екстензија „.crypto“. Потоа, за сите најдени датотеки, скриптата треба да провери во кои датотеки има барем еден
# од следниве крипто-валути како збор: BTC, Doge, EOS, ETH и XPM. Оние датотеки што го исполнуваат условот, нивната содржина се
# спојува во датотека со име „all.crypto“ (оваа датотека не постои, треба да се креира во тековниот директориум) а потоа се повикува
# Python скриптата од претходната задача, каде како аргумент и се испраќа датотеката „all.crypto“. Shell скриптата на екран печати
# колку крипто-вредности има пронајдено Python скриптата од претходната задача. 

# #!/bin/bash

> all.crypto

for file in $(find . -name "*.crypto"); do
    if grep -q -e "BTC" -e "Doge" -e "EOS" -e "ETH" -e "XPM" "$file"; then
        cat "$file" >> all.crypto 
        echo "" >> all.crypto 
    fi
done

if [ -n all.crypto ]; then
    python3 zad14.py all.crypto
else
    echo "Ne postojat datoteki so .crypto."
fi