# Да се напише Shell скрипта која како аргументи од командна линија добива имиња на два директориуми,
# притоа доколку се повика без аргументи, скриптата испишува порака за грешка, додека пак, доколку се
# повика со еден аргумент, вториот се смета дека е тековниот директориум. Скриптата треба да ја земе првата
# текстуална датотека од двата директориуми (со екстензија .txt) и да ја повика Python скриптата, со тоа што
# како прв аргумент ќе се прати датотеката од првиот директориум, додека како втор аргумент датотеката од
# вториот директориум. Доколку двата директориуми се исти, тогаш вториот директориум се заменува со
# тековниот директориум. На крај да се отпечати резултатот од извршување на Python скриптата.


#!/bin/sh
prvD=''
vtorD=''

if [ $# -eq 0 ] then
    exit 'poraka za greska'
elif [ $# -eq 1 ] then
    prvD=$1
    vtorD='.'
else 
    prvD=$1
    vtorD=$2
fi

if [ $prvD -eq $vtorD ] then
    vtorD='.'
fi

dat1 = $(ls -al $prvD | grep *.txt | head -1)
dat2 = $(ls -al $vtorD | grep *.txt | head -1)

echo $(zad5.py $dat1 $dat2)