# Да се напише SHELL скрипта која треба да ги најде сите датотеки (во тековниот директориум и
# поддиректориумите) кои имаат наставка (екстензија) „.py3“. Потоа, скриптата треба за секоја
# датотека со наставка „.py3“ да најде датотека со исто име како и датотеката само со екстензија 
# „.со“. (Пример, ако најде датотека со име prvadat.py3, пребарува дали има датотека со име
# prvadat.co (во тековниот директориум и поддиректориумите). Скриптата, за секој пар датотеки
# што ќе ги најде датотека со наставка „.py3“ и датотека со исто име само со наставка „.co“, ја 
# повикува Python скриптата од првата задача и како аргументи им ги праќа ове две датотеки.


#!/bin/bash

for py3_file in $(find . -type f -name "*.py3"); do
    co_file="${py3_file%.py3}.co"
    
    if [ -f "$co_file" ]; then
        python3 prva.py3 "$py3_file" "$co_file"
    fi
done