# Да се напише SHELL скрипта која како аргумент добива даден збор. Shell скриптата треба да ги
# најде сите текстуални датотеки во кои се содржи тој збор (во тековниот директориум и
# поддиректориумите). Секоја датотека која ќе се најде, се повикува одделно Python скриптата од
# првата задача, каде како прв аргумент се праќа името на датотеката, додека пак како втор
# аргумент се праќа зборот (што се добива како аргумент на Shell скриптата). Резултатот од
# извршувањето на секоја Python скрипта се печати на екран. 

#!/bin/bash

if [ $# -ne 1 ]; then
    echo "Nedovolen broj na argumenti"
    exit 1
fi

ZBOR=$1 

for FILE in $(find . -type f -name "*.txt"); do
    if grep "$ZBOR" "$FILE"; then
        echo $(python3 prva.py3 "$FILE" "$ZBOR")
    fi
done