# Да се напише SHELL скрипта која како аргумент добива листа од имиња од датотеки. Скриптата, за
# секоја датотека (име од датотека) да провери дали ја има како датотека во тековниот директориум, или
# под-директориуми. Доколку ја има, проверува дали датотеката (во нејзината содржина) има барем еден
# валиден датум (DD-MM-YYYY), и доколку нема, ја игнорира. Доколку има валиден датум, тогаш ја
# повикува PERL скриптата и како прв аргумент го праќа името на датотеката, и т.н. со сите датотеки што
# се пратени како аргументи од командна линија. За секоја датотека што ќе биде пратена
# на PERL скриптата, се печати на екран нејзиното име и колку различни датуми се пронајдени.

#!/bin/bash

for dat in $@ 
do 
l= $(find .-name $dat)

if [ -n "$l" ]
then 
    z=$(sed -n '/[0-9][0-9]-[0-9][0-9]-[0-9][0-9][0-9][0-9]/p' $l | wc -l)

    if [ $z -ge 1 ]
    then
        z=`python3 prva.py3 $l | wc -l`
        echo "$l $z"
    fi
fi
done