# Да се напише SHELL скрипта која како аргумент од командна линија добива име на влезна
# датотека. Доколку не се прати аргумент на командна линија, тогаш се пребарува датотека со име
# „naredbi.txt“ во тековниот директориум и неговите поддиректориуми и доколку се најде, тогаш се
# копира таа датотека во тековниот директориум (доколку истата не е во тековниот директориум).
# Доколку се најде датотеката, тогаш се печати нејзината содржина на екран, инаку се печати
# порака дека датотеката не е пронајдена.


#!/bin/bash 

if [ -n "$1" ]; then
    file=$1
else
    file=$(find / -name "naredbi.txt")

    if [ -f "$file" ]; then
        if [ "$(dirname "$file")" != "." ]; then
            cp "$file" .
        fi
    else
        echo "Datotekata 'naredbi.txt' ne e pronajdena"
        exit 1
    fi
fi

if [ -f "$file" ]; then
    cat "$file"
else
    echo "Datotekata ne e pronajdena"
fi