# Да се напише Python скрипта со име „prva.py“ која како аргументи добива најпрво збор кој ќе го пребарува, 
# опција (знаменце) и име на датотека во која ќе се прави пребарувањето. Скриптата треба да го пребара 
# зборот (што се праќа како прв аргумент) во зависност од опцијата (што се праќа како втор аргумент) во 
# датотеката (чие име се праќа како трет аргумент). Опцијата може да биде „l“, „w“ или „f“, при што 
# опцијата „l“ значи дека треба да се вратат броевите од линиите во кои е пронајден зборот, „w“ како резултат 
# враќа колку зборови биле пронајдени пред зборот што се бара, а опцијата „f“ враќа колку пати е пронајден зборот во датотеката. 
# Доколку зборот го нема во датотеката, опциите „l“ враќа -1, додека пак опциите „w“ и „f“ враќаат соодветно вредност 0. 
# Зборовите се одделени еден од друг со празно место. Доколку добие невалидна опција, скриптата прекинува со извршување.

#!/usr/bin/python3

import sys

if len(sys.argv) < 4:
    print("Nedovolen broj na argumenti")
    sys.exit()

zbor = sys.argv[1]
zname = sys.argv[2]

if zname not in ["l", "w", "f"]:
    print("Nevalidno zname")
    sys.exit()

l = 0
w = 0
f = 0

dat = open(sys.argv[3], "r")

for l in dat.readlines():
    l = l.strip()
    zborovi = l.split(" ")

    for z in zborovi:
        if zbor == z:
            if zname == "l":
                print(l)
            elif zname == "w":
                print(w)
            else:
                f += 1
        w += 1
    l += 1

dat.close()

if zname == "f":
    print(f)

if f == 0:
    if zname == "l":
        print(-1)
    elif zname == "w":
        print(0)