# Да се напише Python скрипта за работа со датотеки. Скриптата, како аргумент од командна линија добива
# име на една влезна датотека. Скриптата треба да ги најде сите телефонски броеви во датотеката и
# сопствениците на тие телефонски броеви. Секој телефонски збор е составен од 9 цифри, притоа
# започнува со 07. Скриптата треба да ги најде сите различни телефонски броеви и на крај да ги отпечати.
# Зборот пред секој телефонски број означува кој е корисникот на кој припаѓа тој телефонски број.
# Скриптата треба да го отпечати на екран името на сопственикот на телефонскиот број и самиот
# телефонски број. Доколку во датотеката истиот телефонски број се појавува со различни корисници,
# тогаш се печати само последниот корисник што ќе биде пронајден во датотеката за тој телефонски број.
# Секој збор од друг збор во датотеката е одделен со празно место.

import sys

if len(sys.argv) < 2:
    print("Nedovolen broj na argumenti")
    sys.exit(1)


dat = open(sys.argv[1], "r")  

tel_broevi = {}

for line in dat:
    zborovi = line.split()

    for i in range(1, len(zborovi)):
        z = zborovi[i]

        if len(z) == 9 and z.isdigit() and z.startwith("07"):
            sopstvenik = zborovi[i - 1]
            tel_broevi[z] = sopstvenik

dat.close()

for num, owner in tel_broevi.items():
    print(f"Sopstvenik: {owner}, Telefon: {num}")
