# Да се напише Python скрипта за работа со датотеки. Скриптата, како аргумент од командна линија добива
# име на една влезна датотека. Скриптата треба да ги најде сите телефонски броеви во датотеката и
# сопствениците на тие телефонски броеви. Секој телефонски збор е составен од 9 цифри, притоа
# започнува со 07. Скриптата треба да ги најде сите различни телефонски броеви и на крај да ги отпечати.
# Зборот пред секој телефонски број означува кој е корисникот на кој припаѓа тој телефонски број.
# Скриптата треба да го отпечати на екран името на сопственикот на телефонскиот број и самиот
# телефонски број. Доколку во датотеката истиот телефонски број се појавува со различни корисници,
# тогаш се печати само последниот корисник што ќе биде пронајден во датотеката за тој телефонски број.
# Секој збор од друг збор во датотеката е одделен со празно место.
# Потоа, да се напише Shell скрипта која како аргумент од командна линија добива еден телефонски број
# (низа од 9 цифри која започнува со 07). Скриптата треба да ја повика Python скриптата од претходно со
# секоја една датотека што ќе ја најде во тековниот директориум со екстензија „.рр“. Скриптата треба да
# провери за секоја една датотека дали воопшто го има телефонскиот број што го добива како аргумент и
# доколку го има, да го отпечати името на корисникот на тој телефонски број.

import sys

if len(sys.argv) < 2:
    print("Nedovolen broj na argumenti")
    sys.exit(1)


dat = open(sys.argv[1], "r")  

tel_broevi = {}

for line in dat:
    zborovi = line.split()

    for i in range(1, len(zborovi)):
        z = zborovi[i]

        if len(z) == 9 and z.isdigit() and z.startwith("07"):
            sopstvenik = zborovi[i - 1]
            tel_broevi[z] = sopstvenik

dat.close()

for num, owner in tel_broevi.items():
    print(f"Sopstvenik: {owner}, Telefon: {num}")


# SHELL SKRIPTATA

#!/bin/bash

# if [[ $# -ne 1]]; then
#     echo "Nemate vneseno tel broj"
#     exit 1
# fi

# if [[ echo "$1" | grep -v "^07[0-9][0-9][0-9][0-9][0-9][0-9][0-9]$" ]]; then
#     echo "Nevaliden tel broj"
#     exit 1

# tel_broj=$1
# found=0

# for file in *.rr; do
#     if [[ -e "$file" ]]; then
#         result = $(python3 zad3.py "$file" | grep "$tel_broj")

#         if [[ -n "$result" ]]; then
#             echo "Tel broj: $tel_broj e pronajden vo dat $file"
#             echo "$result"
#             found=1
#         fi
#     fi
# done

# if [[ $found -eq 0] ]; then
#     echo "Tel broj $tel_broj ne e pronajden"
# fi